Soundwave0245/stm32-ball-balancing-control-On-a-Moving-Vehicle-/电赛小车部分 -缓速启动，按键控制启动 - 缓速停止 - 启动保护/Hardware/Serial.c
#include "stm32f10x.h"                  // Device header
#include <stdio.h>
#include <stdarg.h>

#define TxPacket_Length 4       //串口发送数据包长度
#define RxPacket_Length 4       //串口接收数据包长度，修改这里同时状态机的接收长度也会修改

uint8_t Serial_TxPacket[TxPacket_Length];
uint8_t Serial_RxPacket[RxPacket_Length];
uint8_t Serial_RxFlag;

void Serial_Init(void)
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;                 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&GPIO_InitStructure);

	
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = 9600;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;             //Tx :Send out the signal
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b ;
	USART_Init(USART3,&USART_InitStructure);
	
	USART_ITConfig(USART3,USART_IT_RXNE,ENABLE);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	
	USART_Cmd(USART3,ENABLE);
}



void Serial_SendByte(uint16_t Data)
{
	USART_SendData(USART3,Data);
	while(USART_GetFlagStatus(USART3,USART_FLAG_TXE)==RESET);
}

void Serial_SendArray(uint8_t *array, uint16_t Length)
{
	uint16_t i;
	for(i=0; i<Length; i++)
	{
		Serial_SendByte(array[i]);
	}
	
}
	
void Serial_SendString(char* String)
{
	uint16_t i;
	for(i=0;String[i] != '\0';i++)
	{
		Serial_SendByte(String[i]);
	}
	
}

uint32_t Serial_Pow(uint16_t X,uint16_t Y)
{
	uint32_t Result = 1;
	while(Y--) 
	{
		Result*=X;
	}
	
	return Result;
}

void Serial_SendNum(uint32_t Number,uint16_t Length)
{
	uint16_t i;
	for(i=0; i<Length; i++)
	{
		Serial_SendByte(Number/Serial_Pow(10,Length-i-1)%10 + 0x30);
	}
}

int fputc(int ch,FILE *f)
{
	Serial_SendByte(ch);
	return ch;
}

uint8_t Serial_GetRxFlag(void)
{
	if(Serial_RxFlag == 1)
	{
		Serial_RxFlag = 0;
		return 1;
	}
	else
		return 0;
}

void Serial_SendPacket(void)
{
	Serial_SendByte(0xFF);
	Serial_SendArray(Serial_TxPacket,TxPacket_Length);
	Serial_SendByte(0xFE);
}


void Serial_Printf(char *format,...)
{
	char String[100];
	va_list arg;
	va_start(arg,format);
	vsprintf(String,format,arg);
	va_end(arg);
	Serial_SendString(String);
	
}

void USART3_IRQHandler(void)                                             //状态机接收数据，0xFF ?? ?? ?? ?? 0xFE
{
	if (USART_GetITStatus(USART3,USART_IT_RXNE)==SET)
	{
		static uint8_t RxState = 0; 
		static uint8_t pRxPacket;
		
		if(RxState == 0)
		{
			if(USART_ReceiveData(USART3) == 0xFF)
			{
				RxState = 1;
				pRxPacket = 0;
			}
		}
		else if(RxState == 1)
		{
			Serial_RxPacket[pRxPacket] = USART_ReceiveData(USART3);
			pRxPacket++ ;
			if(pRxPacket >= RxPacket_Length)
			{
				RxState = 2;
			}
		}
		else if(RxState == 2)
		{
			if(USART_ReceiveData(USART3) == 0xFE)
			{
				RxState = 0;
				Serial_RxFlag = 1;
			}
		}
		
		USART_ClearITPendingBit(USART3,USART_IT_RXNE);
	}
}


